microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/hardware_access_functions.c
/**
  @File Name:
    hardware_access_functions.c

  @Summary:
    This module provides hardware access function support.

  @Description:
    This module provides hardware access function support.
 */
/*******************************************************************************
* Copyright (c) 2017 released Microchip Technology Inc.  All rights reserved.
*
* SOFTWARE LICENSE AGREEMENT:
* 
* Microchip Technology Incorporated ("Microchip") retains all ownership and
* intellectual property rights in the code accompanying this message and in all
* derivatives hereto.  You may use this code, and any derivatives created by
* any person or entity by or on your behalf, exclusively with Microchip's
* proprietary products.  Your acceptance and/or use of this code constitutes
* agreement to the terms and conditions of this notice.
*
* CODE ACCOMPANYING THIS MESSAGE IS SUPPLIED BY MICROCHIP "AS IS".  NO
* WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
* TO, IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE APPLY TO THIS CODE, ITS INTERACTION WITH MICROCHIP'S
* PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.
*
* YOU ACKNOWLEDGE AND AGREE THAT, IN NO EVENT, SHALL MICROCHIP BE LIABLE,
* WHETHER IN CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE OR BREACH OF
* STATUTORY DUTY),STRICT LIABILITY, INDEMNITY, CONTRIBUTION, OR OTHERWISE,
* FOR ANY INDIRECT, SPECIAL,PUNITIVE, EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL
* LOSS, DAMAGE, FOR COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE CODE,
* HOWSOEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR
* THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT ALLOWABLE BY LAW,
* MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS CODE,
* SHALL NOT EXCEED THE PRICE YOU PAID DIRECTLY TO MICROCHIP SPECIFICALLY TO
* HAVE THIS CODE DEVELOPED.
*
* You agree that you are solely responsible for testing the code and
* determining its suitability.  Microchip has no obligation to modify, test,
* certify, or support the code.
*
*******************************************************************************/
#include <string.h>
#include <stdbool.h>
#include <xc.h>
#include "hardware_access_functions.h"
static bool HAL_GateDriver_Initialize(GATE_DRIVER_OBJ *);
static void HAL_GateDriver_Enable(GATE_DRIVER_OBJ *);
static void HAL_GateDriver_Disable(GATE_DRIVER_OBJ *);
static void HAL_GateDriver_Connect(GATE_DRIVER_HOST_INTERFACE *);
static GATE_DRIVER_CONFIG_STATE HAL_GateDriver_Install(GATE_DRIVER_OBJ *);
static GATE_DRIVER_OPERATION_STATE HAL_GateDriver_ReadStatus(GATE_DRIVER_OBJ *);
static GATE_DRIVER_OPERATION_STATE HAL_GateDriver_AutoBaudSequence(GATE_DRIVER_OBJ *);
static void HAL_GateDriver_Write(GATE_DRIVER_HOST_INTERFACE *,uint16_t );
static uint16_t HAL_GateDriver_Read(GATE_DRIVER_HOST_INTERFACE *);
static bool HAL_GateDriver_SchedulerRun(uint16_t *);
static bool HAL_GateDriver_Initialize_CommChannel(GATE_DRIVER_OBJ *);
static bool HAL_GateDriver_HookUARTFunctions(GATE_DRIVER_HOST_INTERFACE *,uint16_t);
static GATE_DRIVER_HANDLER_STATE HAL_GateDriver_Configure(GATE_DRIVER_OBJ *,
        uint16_t );
static GATE_DRIVER_HANDLER_STATE HAL_GateDriver_Status(GATE_DRIVER_OBJ * );
GATE_DRIVER_OBJ inverterGateDriver[BSP_GATE_DRIVER_INSTANCE_COUNT];
static GATE_DRIVER_HOST_INTERFACE gateDriverInterface[BSP_GATE_DRIVER_INSTANCE_COUNT];

void HAL_GateDriver_FaultClear(GATE_DRIVER_OBJ *);
void HAL_GateDriver_AutoBaudRequest(GATE_DRIVER_OBJ *);

/*****************************************************************************/
/* Section: HAF board functions                                              */
/*****************************************************************************/

HAL_BOARD_STATUS HAL_Board_Configure(void)
{
    /* Configure the PWM driver and collect status information of this task */
    HAL_BOARD_STATUS status = HAL_GateDriver_Configure(&inverterGateDriver[BSP_GATE_DRIVER_A_INDEX],BSP_GATE_DRIVER_A_INDEX);
        
    return status;
}

HAL_BOARD_STATUS HAL_Board_Service(void)
{
    
    HAL_BOARD_STATUS status = HAL_GateDriver_Status(&inverterGateDriver[BSP_GATE_DRIVER_A_INDEX]);
    
    return status;    
}

void HAL_Board_FaultClear(void)
{
    HAL_GateDriver_FaultClear(&inverterGateDriver[BSP_GATE_DRIVER_A_INDEX]);
}

void HAL_Board_AutoBaudRequest(void)
{
    HAL_GateDriver_AutoBaudRequest(&inverterGateDriver[BSP_GATE_DRIVER_A_INDEX]);
}
/*****************************************************************************/
/* Section: Private driver interface functions                               */
/*****************************************************************************/
/**
 * Hardware Access Function to configure the Gate Driver 
 * @param pGateDriver gate driver data
 * @param gateDriverID The instance of the gate Driver on the board
 * @return GATEDRIVER_HANDLER_STATE returns the task status
 * @example
 * <code>
 * status = HAL_GateDriver_Configure(GATEDRIVER_A);
 * </code>
 */
GATE_DRIVER_HANDLER_STATE HAL_GateDriver_Configure(GATE_DRIVER_OBJ *pGateDriver,
        uint16_t gateDriverID)
{   
    /* Waits for  Gate Driver Scheduler Timeout,if activated ; 
     * This allows wait states between different events */
    if (HAL_GateDriver_SchedulerRun(&pGateDriver->timeout) == true)
    {

        switch(pGateDriver->configState)
        {
            case GATE_DRIVER_CONFIG_UNINITIALISED:
                pGateDriver->gateDriverID = gateDriverID;
                if (HAL_GateDriver_Initialize(pGateDriver))
                {
                    pGateDriver->configState = GATE_DRIVER_CONFIG_DISABLED;
                }
                else
                {
                    pGateDriver->configState = GATE_DRIVER_CONFIG_ERROR;
                }
            break;
            case GATE_DRIVER_CONFIG_DISABLED:
                HAL_GateDriver_Enable(pGateDriver);
                pGateDriver->configState = GATE_DRIVER_CONFIG_DISCONNECTED;
            break;
            case GATE_DRIVER_CONFIG_DISCONNECTED:
                HAL_GateDriver_Connect(pGateDriver->pHostInterface);
                pGateDriver->configState = GATE_DRIVER_CONFIG_AUTOBAUD;
            break;
            case GATE_DRIVER_CONFIG_AUTOBAUD:
                if ((uint16_t)HAL_GateDriver_AutoBaudSequence(pGateDriver)  == 
                                                               GATE_DRIVER_DONE)
                {
                    pGateDriver->configState = GATE_DRIVER_CONFIG_CONNECTED;
                    pGateDriver->tryAgainCount = 0;
                }
            break;
            case GATE_DRIVER_CONFIG_TRYAGAIN:
                if (pGateDriver->tryAgainCount < GATE_DRIVER_TRYCOUNT_MAX)
                {
                    pGateDriver->tryAgainCount++;
                    HAL_GateDriver_Disable(pGateDriver);
                    pGateDriver->configState = GATE_DRIVER_CONFIG_DISABLED;

