microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/hardware_access_functions.c
                }
                else
                {
                    pGateDriver->tryAgainCount = GATE_DRIVER_TRYCOUNT_MAX;
                    pGateDriver->configState = GATE_DRIVER_CONFIG_ERROR;
                }
            break;
            case GATE_DRIVER_CONFIG_CONNECTED:
                pGateDriver->configState = HAL_GateDriver_Install(pGateDriver);
                if (pGateDriver->configState==GATE_DRIVER_CONFIG_INSTALLED)
                {
                    pGateDriver->activeState = GATE_DRIVER_OP_READY;
                    pGateDriver->tryAgainCount = 0;
                }
            break;
                /* After configuring/installing the gate driver this function 
                 * (i.e. when configState = GATE_DRIVER_CONFIG_INSTALLED,
                 * does not have any further actions to perform,hence
                 * function exit by returning configState */
            case GATE_DRIVER_CONFIG_INSTALLED:
                /* Similarly ,if an error is encountered ,it 
                 * indicates there is some issue with communication channel,
                 * or the configuration message sent to the gate driver or 
                 * similar.
                 * This (configState = GATE_DRIVER_CONFIG_ERROR) ,requires 
                 * attention from the user,and hence function does nothing and
                 * returns configState to the application indicating the same.*/
            case GATE_DRIVER_CONFIG_ERROR:

            default:
            break;  
        }
    }
    return pGateDriver->configState;
}

/**
 * Hardware Access Function to read the Gate Driver Status 
 * @param pGateDriver gate driver data
 * @return GATEDRIVER_HANDLER_STATE returns the task status
 * @example
 * <code>
 * status = HAF_GateDriver_Status(GATEDRIVER_A);
 * </code>
 */
GATE_DRIVER_HANDLER_STATE HAL_GateDriver_Status(GATE_DRIVER_OBJ *pGateDriver)
{    
    if(pGateDriver->activeState == GATE_DRIVER_OP_DONE)
    {
        if(pGateDriver->autoBaudRequest == 1)            
        {
            pGateDriver->autoBaudInitiate = 1;
            pGateDriver->autoBaudRequest = 0;
            pGateDriver->timeoutResidue = pGateDriver->timeout;
            pGateDriver->timeout = 0;
        }
    }
    else
    {
        if(pGateDriver->autoBaudInitiate  == 0)
        {
            pGateDriver->autoBaudRequest = 1;
        }

    }
    /* Waits for  Gate Driver Scheduler Timeout,if activated ; 
     * This allows wait states between different events */
    if ((HAL_GateDriver_SchedulerRun(&pGateDriver->timeout) == true))
    {   

        /* If Gate Driver internal Operation state anything other than 
         * GATE_DRIVER_OP_NOT_READY ,GATE_DRIVER_OP_TRYAGAIN,
         * Gate Driver operation status can be requested */
        if (pGateDriver->activeState == GATE_DRIVER_OP_TRYAGAIN)
        {
            if (pGateDriver->tryAgainCount < GATE_DRIVER_TRYCOUNT_MAX)
            {
                pGateDriver->tryAgainCount++;
                pGateDriver->statusRegIndex = 0;
                pGateDriver->activeState = GATE_DRIVER_OP_READY;
            }
            else
            {
                pGateDriver->tryAgainCount = GATE_DRIVER_TRYCOUNT_MAX;
                pGateDriver->statusRegIndex = 0;
                pGateDriver->activeState = GATE_DRIVER_OP_ERROR;
            }
        }
        else if (pGateDriver->activeState != GATE_DRIVER_OP_NOT_READY)
        {
            if(pGateDriver->autoBaudInitiate == 1) 
            {
                /* Call the Gate Driver read Status Function */
                pGateDriver->activeState = HAL_GateDriver_AutoBaudSequence(pGateDriver);
            }
            else
            {
                /* Call the Gate Driver read Status Function */
                pGateDriver->activeState = HAL_GateDriver_ReadStatus(pGateDriver);
            }
        }      
    }
    /* Returns the Gate Driver Operation Status */
    return pGateDriver->activeState;
}

/**
 * Function to Initialize the Gate Driver 
 * @param pGateDriver gate driver data
 * @return true = success false = failure
 * @example
 * <code>
 * HAL_GateDriver_Initialize(&gateDriver);
 * </code>
 */
static bool HAL_GateDriver_Initialize(GATE_DRIVER_OBJ *pGateDriver)
{
    /* Resets the Gate Driver Object */
    memset(pGateDriver,0,sizeof(GATE_DRIVER_OBJ));
    
    /* Initialize the CE signal port SFR and bit mask */
    pGateDriver->chipEnablePort = BSP_LATCH_GATE_DRIVER_A_CE_PORT;
    pGateDriver->chipEnableMask = 1<<BSP_LATCH_GATE_DRIVER_A_CE_BIT;
    
    /* Ensures  that the Gate Driver is disabled */
    HAL_GateDriver_Disable(pGateDriver);
    /* Initialize Gate Driver Command Options*/
    pGateDriver->cmd0Data.byte = 0;
    pGateDriver->cmd0Data.sleepMode = GATE_DRIVER_ENTERS_STANDBY_MODE;
    pGateDriver->cmd0Data.extFETUVLockOut = GATE_DRIVER_EXTFET_UVLO_ENABLED;
    pGateDriver->cmd0Data.extFETSCDetection = GATE_DRIVER_EXTFET_SCDETECT_ENABLED;
    pGateDriver->cmd0Data.extFETOCLimit = GATE_DRIVER_EXTFET_OCLIM_1V; 
        
    pGateDriver->cmd2Data.byte = 0;
    pGateDriver->cmd2Data.blankingTime = GATE_DRIVER_BLANKING_4000nS;
    pGateDriver->cmd2Data.deadTime = GATE_DRIVER_DEADTIME_2000nS;
    
    /* Store Pointer to Host Interface structure */
    pGateDriver->pHostInterface = &gateDriverInterface[pGateDriver->gateDriverID];
    /* Store Gate Driver ID back in the Gate Driver Structure*/
    /* Function call to initialize Communication Interface between controller 
     and Gate Driver*/
    return HAL_GateDriver_Initialize_CommChannel(pGateDriver);
}

/**
 * Function to enable the Gate Driver. The function sets the chip enable pin 
 * of the gate driver(CE = 1) by holding the port pin 'HIGH'.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Enable(pGateDriver);
 * </code>
 */
void HAL_GateDriver_Enable(GATE_DRIVER_OBJ *pGateDriver)
{
   *(pGateDriver->chipEnablePort) |= pGateDriver->chipEnableMask;
}

/**
 * Function to disable the Gate Driver.The function resets the chip enable pin 
 * of the gate driver(CE = 0) by holding the port pin 'LOW'.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Disable(pGateDriver);
 * </code>
 */
void HAL_GateDriver_Disable(GATE_DRIVER_OBJ *pGateDriver)
{
   *(pGateDriver->chipEnablePort) &= ~pGateDriver->chipEnableMask;
}

/**
 * Function to establish communication interface between gate driver and 
 * controller 
 * @param pHostInterface - pointer to the Host Interface
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Connect(&hostInterface);
 * </code>
 */
void HAL_GateDriver_Connect(GATE_DRIVER_HOST_INTERFACE* pHostInterface)
{ 
    uint16_t baudRate = pHostInterface->baudRateScaler;

    pHostInterface->Initialize();
    pHostInterface->SpeedModeStandard();
    pHostInterface->BaudRateDividerSet(baudRate);
    pHostInterface->ModuleEnable();
    pHostInterface->TransmitModeDisable();
    pHostInterface->status =  GATE_DRIVER_INTERFACE_ENABLED;
}

/**
 * Function configure the gate driver by writing to Driver Configuration 
 * Registers 0-2.This is achieved by sending commands SET_CONFIG_0(0x81),
 * SET_CONFIG_1(0x83),SET_CONFIG_2(0X87) along with value/option to be written 
 * in to driver configuration registers.in response to command sent by the host.
 * Also the HAL_GateDriver_Install() validates the acknowledgment message from 
 * driver to confirm the successful receipt of commands and  options.
 * 
 * @param pGateDriver gate driver data
 * @return GATE_DRIVER_CONFIG_STATE status of the Gate Driver configuration
 * @example
 * <code>
 * HAL_GateDriver_Install(&gateDriver);
 * </code>
 */
GATE_DRIVER_CONFIG_STATE HAL_GateDriver_Install(GATE_DRIVER_OBJ* pGateDriver)
{ 
    uint16_t ackData[4];
    GATE_DRIVER_CONFIG_STATE state = GATE_DRIVER_CONFIG_CONNECTED; 
    switch(pGateDriver->installState)
    {
        case GATE_DRIVER_STATE_CMD_SET_CFG0:
            pGateDriver->pHostInterface->TransmitModeEnable();
            pGateDriver->pHostInterface->ReceiveBufferOverrunErrorFlagClear();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_SET_CFG0);
            HAL_GateDriver_Write(pGateDriver->pHostInterface,pGateDriver->cmd0Data.byte);
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_SETRXPIN_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_RX_CFG0;
        break;
        case GATE_DRIVER_STATE_ACK_RX_CFG0:
            pGateDriver->pHostInterface->TransmitModeDisable();
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_SET_CFG0;

        break;
        case GATE_DRIVER_STATE_ACK_SET_CFG0:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[3] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG2;
            if (ackData[0] != GATE_DRIVER_CMD_SET_CFG0)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[1] != pGateDriver->cmd0Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN; 
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[2] != GATE_DRIVER_ACK_SET_CFG0)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[3] != pGateDriver->cmd0Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
        break;
        case GATE_DRIVER_STATE_CMD_SET_CFG2:
            pGateDriver->pHostInterface->TransmitModeEnable();
            pGateDriver->pHostInterface->ReceiveBufferOverrunErrorFlagClear();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_SET_CFG2);
            HAL_GateDriver_Write(pGateDriver->pHostInterface,pGateDriver->cmd2Data.byte);
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_SETRXPIN_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_RX_CFG2;
        break;
        case GATE_DRIVER_STATE_ACK_RX_CFG2:
            pGateDriver->pHostInterface->TransmitModeDisable();
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_SET_CFG2;

        break;
        case GATE_DRIVER_STATE_ACK_SET_CFG2:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[3] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            state = GATE_DRIVER_CONFIG_INSTALLED;
            if (ackData[0] != GATE_DRIVER_CMD_SET_CFG2)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[1] != pGateDriver->cmd2Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN; 
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[2] != GATE_DRIVER_ACK_SET_CFG2)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[3] != pGateDriver->cmd2Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }

        break;
        default:
            state = GATE_DRIVER_CONFIG_TRYAGAIN;
            pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
        break;
    }
    return state;
}

/**
 * Function to read the status from Gate Driver 
 * @param pGateDriver gate driver data
 * @return GATE_DRIVER_OPERATION_STATE status of the Gate Driver Status Read
 * @example
 * <code>
 * HAL_GateDriver_ReadStatus(&gateDriver);
 * </code>
 */
GATE_DRIVER_OPERATION_STATE HAL_GateDriver_ReadStatus(GATE_DRIVER_OBJ* pGateDriver)
{ 
    GATE_DRIVER_OPERATION_STATE state = GATE_DRIVER_OP_BUSY;
    uint16_t ackData[3];
    switch(pGateDriver->statusRegIndex)
    {
        case GATE_DRIVER_STATE_CMD_READ_STATUS0:
            pGateDriver->pHostInterface->TransmitModeEnable();
            pGateDriver->pHostInterface->ReceiveBufferOverrunErrorFlagClear();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_GET_STATUS0);
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_SETRXPIN_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_RX_STATUS0;
        break;
        case GATE_DRIVER_STATE_ACK_RX_STATUS0:
            pGateDriver->pHostInterface->TransmitModeDisable();
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_READ_STATUS0;
        break;
        case GATE_DRIVER_STATE_ACK_READ_STATUS0:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS1;
            if (ackData[0] != GATE_DRIVER_CMD_GET_STATUS0)
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            if (ackData[1] != GATE_DRIVER_ACK_GET_STATUS0)
            {
                state = GATE_DRIVER_OP_TRYAGAIN; 
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            pGateDriver->status0Data.byte = (uint8_t)ackData[2];

        break;
        case GATE_DRIVER_STATE_CMD_READ_STATUS1:
            pGateDriver->pHostInterface->TransmitModeEnable();
            pGateDriver->pHostInterface->ReceiveBufferOverrunErrorFlagClear();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_GET_STATUS1);
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_SETRXPIN_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_RX_STATUS1;
        break;
        case GATE_DRIVER_STATE_ACK_RX_STATUS1:
            pGateDriver->pHostInterface->TransmitModeDisable();
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_READ_STATUS1;
        break;
        case GATE_DRIVER_STATE_ACK_READ_STATUS1:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            if (ackData[0] != GATE_DRIVER_CMD_GET_STATUS1)
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            if (ackData[1] != GATE_DRIVER_ACK_GET_STATUS1)
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            pGateDriver->status1Data.byte = (uint8_t)ackData[2];
            
            state = GATE_DRIVER_OP_DONE;
            if (pGateDriver->status0Data.byte)
            {
                state = GATE_DRIVER_OP_ERROR;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            if (pGateDriver->status1Data.byte > GATE_DRIVER_STATUS1_ERRATA_MASK)
            {
                state = GATE_DRIVER_OP_ERROR;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            pGateDriver->timeout = GATEDRIVER_STATUS_READ_INTERVAL;
            if (state == GATE_DRIVER_OP_DONE)
            {
                pGateDriver->tryAgainCount = 0;
            }
        break;
        default:
            state = GATE_DRIVER_OP_TRYAGAIN;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
        break;
    }
    return state;
}

GATE_DRIVER_OPERATION_STATE HAL_GateDriver_AutoBaudSequence(GATE_DRIVER_OBJ* pGateDriver)
{ 
    uint16_t flushData = 0;
    GATE_DRIVER_OPERATION_STATE state = GATE_DRIVER_OP_BUSY;

    switch(pGateDriver->autoBaudStateIndex)
    {
        case GATE_DRIVER_STATE_AUTOBAUD_REQUEST:
            pGateDriver->pHostInterface->TransmitModeEnable();
            pGateDriver->pHostInterface->ReceiveBufferOverrunErrorFlagClear();
            if(pGateDriver->pHostInterface->IsTransmissionComplete() == true)
            {
                pGateDriver->pHostInterface->BaudRateDividerSet
                        (GATE_DRIVER_COMM_ABAUD_BREAK_WINDOW_SCALER);        
                pGateDriver->pHostInterface->TransmitBreakRequestFlagSet();
                HAL_GateDriver_Write(pGateDriver->pHostInterface,
                        GATE_DRIVER_ABAUD_BREAK_SEQUENCE_DUMMY_DATA);
                pGateDriver->timeout = GATE_DRIVER_ABAUD_BREAK_SEQUENCE_TIMEOUT ;
                pGateDriver->autoBaudStateIndex = 
                        GATE_DRIVER_STATE_AUTOBAUD_CHARACTER_RECIEVE;
                pGateDriver->de2BaudRateData = 
                        pGateDriver->pHostInterface->BaudRateDivisorRead();
            }
            else
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->autoBaudStateIndex = 
                        GATE_DRIVER_STATE_AUTOBAUD_REQUEST;
                pGateDriver->timeout = GATEDRIVER_STATUS_READ_INTERVAL;
                
