microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/hardware_access_functions.c
            }
        break;
        case GATE_DRIVER_STATE_AUTOBAUD_CHARACTER_RECIEVE:
            pGateDriver->pHostInterface->AutoBaudEnable();
            pGateDriver->pHostInterface->TransmitModeDisable();
            pGateDriver->timeout = GATE_DRIVER_ABAUD_CHARACTER_RECIEVE_TIMEOUT;
            pGateDriver->autoBaudStateIndex = GATE_DRIVER_STATE_AUTOBAUD_VERIFY;
        break;
        case GATE_DRIVER_STATE_AUTOBAUD_VERIFY:
            if(pGateDriver->pHostInterface->IsAutoBaudComplete() == true)
            {
                pGateDriver->de2BaudRateData = 
                        pGateDriver->pHostInterface->BaudRateDivisorRead();
                state = GATE_DRIVER_OP_DONE;
            }
            else
            {
                pGateDriver->pHostInterface->BaudRateDividerSet
                        (GATE_DRIVER_COMM_BAUDRATE_SCALER);
                pGateDriver->pHostInterface->AutoBaudDisable();
                state = GATE_DRIVER_OP_TRYAGAIN;
            }
            flushData = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            flushData = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->pHostInterface->ReceiveBufferOverrunErrorFlagClear();
            pGateDriver->autoBaudStateIndex= GATE_DRIVER_STATE_AUTOBAUD_REQUEST;       
            pGateDriver->timeout = pGateDriver->timeoutResidue;
            pGateDriver->timeoutResidue = GATEDRIVER_STATUS_READ_INTERVAL;
            if (state == GATE_DRIVER_OP_DONE)
            {
                pGateDriver->tryAgainCount = 0;
            }
            pGateDriver->autoBaudInitiate = false ;
        break;
        default:
            state = GATE_DRIVER_OP_TRYAGAIN;
            pGateDriver->autoBaudStateIndex = GATE_DRIVER_STATE_AUTOBAUD_REQUEST;
        break;
    }
    return state;
}

/**
 * Function to write to the Gate Driver
 * @param pHostInterface - pointer to the Host Interface
 * @param data - the data to be send out
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Write(&hostInterface,data);
 * </code>
 */
void HAL_GateDriver_Write(GATE_DRIVER_HOST_INTERFACE* pHostInterface,uint16_t data)
{ 
    if (pHostInterface->StatusBufferFullTransmitGet() == 0)
    {
        pHostInterface->DataWrite(data);
    }
}

/**
 * Function to Read Data from Gate Driver 
 * @param pHostInterface - pointer to the Host Interface
 * @return the data read from the Driver ; 
 *         Function returns GATE_DRIVER_INVALID_DATA if data is not available
 * @example
 * <code>
 * HAL_GateDriver_Read(&hostInterface);
 * </code>
 */
uint16_t HAL_GateDriver_Read(GATE_DRIVER_HOST_INTERFACE* pHostInterface)
{ 
    /** Function returns invalid data,if buffer is empty*/
    uint16_t data = GATE_DRIVER_INVALID_DATA;
    if (pHostInterface->IsReceiveBufferDataReady())
    {
        data = pHostInterface->DataRead();
    }
    return data;
}

/**
 * Implements scheduler and returns the status 
 * @param pTimeout - pointer to the scheduler counter
 * @return true =  timeout expired  false = timer is on and live
 * @example
 * <code>
 * HAL_GateDriver_SchedulerRun();
 * </code>
 */
static bool HAL_GateDriver_SchedulerRun(uint16_t *pTimeout) 
{ 
    if (*pTimeout == 0)
    {
        return true;
    }
    else
    {
        *pTimeout = *pTimeout - 1;
        return false;
    }
}

/**
 * Function to Initialize Communication  Channel .
 * @param pGateDriver - Gate Driver Data
 * @return true =  success  false = failed
 * @example
 * <code>
 * HAL_GateDriver_Initialize_CommunicationCHL(&inverterGateDriver[gateDriverID]);
 * </code>
 */
static bool HAL_GateDriver_Initialize_CommChannel(GATE_DRIVER_OBJ *pGateDriver)
{
    GATE_DRIVER_HOST_INTERFACE *pHostInterface = pGateDriver->pHostInterface;
    
    /* Resets Gate Driver Communication Interface Object */
    memset(pHostInterface,0,sizeof(GATE_DRIVER_HOST_INTERFACE));
    
    /* Identify and initialize Communication peripheral used for establishing
     * communication interface between gate driver and controller */
    pGateDriver->interfaceChannelID = BSP_GATE_DRIVER_INTERFACE_A_UARTMODULE;
    
    /* Initialize function pointer based on the communication module number.*/
    return HAL_GateDriver_HookUARTFunctions(pHostInterface,pGateDriver->interfaceChannelID);
}
/**
 * Function to initialize function pointer .The function assumes that 
 * appropriate UART header is included.
 * @param pHostInterface - pointer to host interface
 * @return true =  success  false = failed
 * @example
 * <code>
 * HAL_GateDriver_HookUARTFunctions(pHostInterface);
 * </code>
 */
static bool HAL_GateDriver_HookUARTFunctions(GATE_DRIVER_HOST_INTERFACE *pHostInterface,uint16_t interfaceChannelID)
{
    if (interfaceChannelID == BSP_GATE_DRIVER_INTERFACE_A_UARTMODULE)
    {
        /* Initialize function pointer based on the communication module number.*/
        pHostInterface->InterruptTransmitFlagClear = 
                UART2_InterruptTransmitFlagClear;
        pHostInterface->InterruptReceiveFlagClear = 
                UART2_InterruptReceiveFlagClear;
        pHostInterface->InterruptTransmitEnable = 
                UART2_InterruptTransmitEnable;
        pHostInterface->InterruptTransmitDisable = 
                UART2_InterruptTransmitDisable;
        pHostInterface->InterruptReceiveEnable = 
                UART2_InterruptReceiveEnable;
        pHostInterface->InterruptReceiveDisable = 
                UART2_InterruptReceiveDisable;
        pHostInterface->Initialize = 
                UART2_Initialize;
        pHostInterface->SpeedModeStandard = 
                UART2_SpeedModeStandard;
        pHostInterface->SpeedModeHighSpeed = 
                UART2_SpeedModeHighSpeed;
        pHostInterface->BaudRateDividerSet = 
                UART2_BaudRateDividerSet;
        pHostInterface->ModuleDisable = 
                UART2_ModuleDisable;
        pHostInterface->ModuleEnable = 
                UART2_ModuleEnable;
        pHostInterface->TransmitModeEnable = 
                UART2_TransmitModeEnable;
        pHostInterface->TransmitModeDisable = 
                UART2_TransmitModeDisable;
        pHostInterface->StatusBufferFullTransmitGet = 
                UART2_StatusBufferFullTransmitGet;
        pHostInterface->DataWrite = UART2_DataWrite;
        pHostInterface->DataRead = UART2_DataRead;
        pHostInterface->IsReceiveBufferDataReady = 
                UART2_IsReceiveBufferDataReady;
        pHostInterface->ReceiveBufferOverrunErrorFlagClear = 
                UART2_ReceiveBufferOverrunErrorFlagClear;
        pHostInterface->IsTransmissionComplete = 
                UART2_IsTransmissionComplete;
        pHostInterface->TransmitBreakRequestFlagSet = 
                UART2_TransmitBreakRequestFlagSet;
        pHostInterface->AutoBaudEnable = 
                UART2_AutoBaudEnable;
        pHostInterface->AutoBaudDisable = 
                UART2_AutoBaudDisable;
        pHostInterface->IsAutoBaudComplete = 
                UART2_IsAutoBaudComplete;
        pHostInterface->BaudRateDivisorRead = 
                UART2_BaudRateDivisorRead;

        pHostInterface->baudRatebps = 0;
        pHostInterface->periphClockHz = 0;
        pHostInterface->baudRateScaler = 
                GATE_DRIVER_COMM_BAUDRATE_SCALER;
        pHostInterface->status =
                GATE_DRIVER_INTERFACE_INITIALIZED;
        return true;
    }
    else
    {
        return false;
    }
}
/**
 * Function to clear the Fault. The function resets the chip enable pin 
 * of the gate driver(CE = 0) by holding the port pin 'LOW'.Then re enables 
 * after specific interval.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Enable(pGateDriver);
 * </code>
 */
void HAL_GateDriver_FaultClear(GATE_DRIVER_OBJ *pGateDriver)
{
    *(pGateDriver->chipEnablePort) &= ~pGateDriver->chipEnableMask;
   __delay_us(GATE_DRIVER_FAULT_CLEARING_PULSE_WIDTH);
    *(pGateDriver->chipEnablePort) |= pGateDriver->chipEnableMask;
}
/**
 * Function to hold the auto baud request.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_AutoBaudRequest(pGateDriver);
 * </code>
 */
void HAL_GateDriver_AutoBaudRequest(GATE_DRIVER_OBJ *pGateDriver)
{
    pGateDriver->autoBaudRequest = 1 ;
}
